// function declaration
// function expression
// arrow function
// function myFn (a,b){
//     if (a>b){
//         return a +10
//     }
//     return  "кичине"
// }
// console.log(myFn(10,5))

// function myFn(name){
//     if (name.includes("r")){
//         return "бар"
//     }
//     return "жок"
// }
//
// console.log(myFn("Sultan"))
//
// console.log(myFn("Askar"))

// function task (name){
//     if (name.length===5){
//         return name.toUpperCase()
//     }
//     return name
// }
//
// console.log(task("Askar"))

// 1. Вам дана переменная a. Если переменная a равна 10, то выведите 'Верно',
// // иначе выведите 'Неверно'.
// let a = 10
// if (a = 10)

// function myFn (a){
//     if (a===10){
//         return"tru"
//     }
//     return "false"
// }

// 2. Вам даны две переменные a=50, b=100. Составьте условие,
// по которому в консоль будет выводиться 'a больше b', 'a меньше b'.
// function name (a,b){
//     if (name(a===50)){
//     }
//    else if (a===50 && b===100){
//       return"верно"
//     }
//     return "неверно"
// }
// 3. Вам дана переменная a=-2. Составьте условие, по которому в
// консоль будет выводиться 'positive' - если число больше 0,
// 'равно' если число равно 0, "negative" если число меньше 0.

// 4. Вам дана переменная number=45. Составьте условие,
// по которому будет выводиться в консоль "Четное число", "Нечетное число".

// 5. Вам даны две переменные a=10, b=2. Составьте условие,
// по которому, остаток деления a на b, будет выводиться консоль
// "Четное число", "Нечетное число".

// 6. Вам дана переменная s. Составьте условие, по которому в
// консоль будет выводится тип этой переменной - "boolean", "number", "string".
// function getType(s){
//     if (typeof s==="string"){
//         return "string"
//     }else if (typeof s==="number"){
//         return "number"
//     }
//     return "boolean"
// }
// console.log(getType(1234))

// 7. Вам дана переменная а. Если переменная a больше
// одного и меньше 9-ти, то выведите 'Верно', иначе выведите 'Неверно'.
// function seven (a){
//     if ( seven(a===5)){
//     }
//     else if (a<1 && a>9){
//         return "true"
//     }
//     return "false"
// }
// console.log("true")

// 8. Вам дана переменная а. Если переменная a равна
// трем или равна семи, то прибавьте к ней 7, иначе поделите
// ее на 10. Выведите новое значение переменной в консоль.

// 9. Вам даны переменные а , b. Если переменная a равна
// или меньше 0, а переменная b больше или равна 5, то
// выведите сумму этих переменных, иначе выведите их разность (результат вычитания).

// 10. Вам даны переменные a , b. Если переменная a больше
// 4-х и меньше 10-ти, или переменная b больше или равна
// 7-ми и меньше 17-ти, то выведите 'Верно', в противном случае выведите 'Неверно'.
// 1. Вам дана переменная a. Если переменная a равна 10, то выведите 'Верно',
// // иначе выведите 'Неверно'.
// let a = 10
// if (a = 10)
// const myFn  = (a)  =>{
//     if (a===10){
//         return"tru"
//     }
//     return "false"
// }
//
// console.log(myFn(a))
// 2. Вам даны две переменные a=50, b=100. Составьте условие,
// по которому в консоль будет выводиться 'a больше b', 'a меньше b'.
// function name (a,b){
//     if (name(a===50)){
//     }
//    else if (a===50 && b===100){
//       return"верно"
//     }
//     return "неверно"
// }
// 3. Вам дана переменная a=-2. Составьте условие, по которому в
// консоль будет выводиться 'positive' - если число больше 0,
// 'равно' если число равно 0, "negative" если число меньше 0.
// 4. Вам дана переменная number=45. Составьте условие,
// по которому будет выводиться в консоль "Четное число", "Нечетное число".
// 5. Вам даны две переменные a=10, b=2. Составьте условие,
// по которому, остаток деления a на b, будет выводиться консоль
// "Четное число", "Нечетное число".
// 6. Вам дана переменная s. Составьте условие, по которому в
// консоль будет выводится тип этой переменной - "boolean", "number", "string".
// function getType(s){
//     if (typeof s==="string"){
//         return "string"
//     }else if (typeof s==="number"){
//         return "number"
//     }
//     return "boolean"
// }
// console.log(getType(1234))
// 7. Вам дана переменная а. Если переменная a больше
// одного и меньше 9-ти, то выведите 'Верно', иначе выведите 'Неверно'.
// function seven (a){
//     if ( seven(a===5)){
//     }
//     else if (a<1 && a>9){
//         return "true"
//     }
//     return "false"
// }
// console.log("true")
// 8. Вам дана переменная а. Если переменная a равна
// трем или равна семи, то прибавьте к ней 7, иначе поделите
// ее на 10. Выведите новое значение переменной в консоль.
// 9. Вам даны переменные а , b. Если переменная a равна
// или меньше 0, а переменная b больше или равна 5, то
// выведите сумму этих переменных, иначе выведите их разность (результат вычитания).
// 10. Вам даны переменные a , b. Если переменная a больше
// 4-х и меньше 10-ти, или переменная b больше или равна
// 7-ми и меньше 17-ти, то выведите 'Верно', в противном случае выведите 'Неверно'.


// const obj = {
//     name:'Askar',
//     age:21
// }
// obj.name='Dastan'
// console.table(obj)


// function sumArray(array) {
//     if(array && array.length > 1 ){
//         const sortedArray = array.sort((a,b) => a - b ).slice(1,-1)
//         return sortedArray.reduce((acc,cur) => acc + cur,0)
//     }
//     return 0
// }
